Repository: zeko868/Croatian-payment-slip-generator-for-WooCommerce
Catalog: languages/croatian-payment-slip-generator-for-woocommerce-*.po
Languages: hr

source: (undefined)
hr: (nedefinirano)

source: [CRO] Payment slip or mobile banking
hr: Plaćanje putem opće uplatnice ili mobilnim bankarstvom

source: as image
hr: kao sliku

source: as PDF
hr: kao PDF dokument

source: Attached file(s) of payment slip in e-mail message
hr: Datoteke s uplatnicom priložene u e-mail poruci

source: Barcode can be added only to the payment slips for national payments.
hr: Barkod može biti dodan samo na naloge za nacionalna plaćanja.

source: Barcode for mobile banking
hr: Barkod za mobilno bankarstvo

source: Below you can find instructions required to make a payment:
hr: U nastavku slijede upute za plaćanje Vaše narudžbe:

source: Choose whether status you wish after checkout.
hr: Odaberite status narudžbe nakon korisnikovog naručivanja robe ovom opcijom.

source: Croatian payment slip generator for WooCommerce
hr: WooCommerce modul za plaćanje putem opće uplatnice ili mobilnim bankarstvom

source: Currency code
hr: Šifra valute

source: Description
hr: Opis

source: Display confirmation part
hr: Prikaži potvrdni listić

source: Display confirmation part of the payment slip
hr: Prikaži potvrdni listić (desni dio) na općoj uplatnici

source: Display image(s) inline in e-mail message body
hr: Integracija priloženih slika u samom tijelu e-mail poruka

source: Display image(s) of payment slip inline in e-mail message body (deselect if you encounter an issue where customers are not receiving e-mail confirmation)
hr: Integracija generiranih slika opće uplatnice u samom tijelu e-mail poruka (odznačite ovu opciju ukoliko naiđete na problem pri kojem korisnici ne dobivaju e-mail potvrdu o kreiranoj narudžbi)

source: Download payment slip
hr: Preuzmi uplatnicu

source: Downloadable file(s) of payment slip on website
hr: Datoteke s uplatnicom raspoložive za preuzimanje na web-stranici

source: Enable payment slip generator for Croatia
hr: Omogući plaćanje općom uplatnicom

source: Enable/Disable
hr: Omogući

source: Font being used for the text that won't be displayed in fields with cells for each character
hr: Font koji će se primijeniti na tekst koji neće biti prikazan u poljima s ćelijama za svaki pojedini znak

source: Generate barcode in PDF417 format
hr: Generiraj barkod u PDF417 formatu

source: Height is being scaled to width proportionally. Leave empty if you don't want to specify dimensions of inline image. Not recommended since in some e-mail clients like Windows 10 Mail UWP app the image would be shown in its original size instead of maximum available space thus often causing the need for using horizontal slider in order to see complete content of the e-mail message.
hr: Visina slike se proporcionalno prilagođava navedenoj širini. Ostavite ovo polje praznim ukoliko ne želite specificirati dimenzije ugrađene slike. No to se baš ne preporuča budući neki e-mail klijenti poput aplikacije Pošta iz Windows 10 bi prikazali sliku u originalnim dimenzijama umjesto da ju prilagode raspoloživom prostoru zbog čega bi korisnik trebao koristiti horizontalne klizače kako bi bio u mogućnosti vidjeti sav sadržaj e-mail poruke.

source: https://wordpress.org/plugins/croatian-payment-slip-generator-for-woocommerce/
hr: https://hr.wordpress.org/plugins/croatian-payment-slip-generator-for-woocommerce/

source: If none specified, the one from the order information will be used
hr: Ako se ništa ne navede, koristit će se ona koja je navedena u podacima o provedenoj narudžbi

source: If your bank account is registered outside of Croatia, you should select 'universal'.
hr: Ako je Vaš bankovni račun izvan Republike Hrvatske, odaberite 'univerzalni' kao tip naloga/opće uplatnice

source: Instructions
hr: Upute za plaćanje

source: Instructions that will be added to the thank you page and emails.
hr: Upute za plaćanje koje će biti nadodane na stranicu sa zahvalom o kupovini kao i u e-mail poruku.

source: Intent code
hr: Svrha plaćanja

source: legal
hr: pravna

source: Main font
hr: Glavni font

source: Make it easy for your customers from Croatia to perform direct bank transfer with generated and pre-filled payment slip, along with mobile banking by simple barcode scanning.
hr: Plaćanje putem opće uplatnice (generira se popunjeni virman) ili mobilnim bankarstvom (spomenuta uplatnica ima na sebi barkod za skeniranje).

source: Make it easy for your customers from Croatia to perform direct bank transfer with generated payment slip, along with barcode for mBanking.
hr: Olakšajte svojim korisnicima plaćanje dodavanjem mogućnosti plaćanja općom uplatnica kao i mobilnim bankarstvom.

source: monospaced
hr: neproporcionalni

source: national
hr: nacionalni

source: natural
hr: fizička

source: normal version
hr: normalna verzija

source: Note:
hr: Napomena:

source: Options for national payment slip type
hr: Postavke vezane uz nalog za nacionalna plaćanja

source: Options for universal payment slip type
hr: Postavke vezane uz univerzalni nalog za plaćanje

source: Order Status
hr: Status narudžbe

source: Other options
hr: Ostale opcije

source: Output image type
hr: Format izlazne slike

source: Pay using generated and pre-filled payment slip or by scanning a barcode through your mobile banking app
hr: Plaćanje općom uplatnicom (virman) ili mobilnim bankarstvom (bar kod)

source: Pay using payment slip or mobile banking
hr: Plaćanje općom uplatnicom ili mobilnim bankarstvom

source: Payment description
hr: Opis plaćanja

source: Payment gateway description on checkout.
hr: Opis metode plaćanja za prikaz prilikom plaćanja

source: Payment gateway title on checkout.
hr: Naziv metode plaćanja za prikaz prilikom plaćanja

source: Payment model
hr: Model plaćanja

source: Payment slip image
hr: slika opće uplatnice

source: Payment slip type
hr: Tip opće uplatnice

source: payment-slip
hr: uplatnica

source: print
hr: tisak

source: print version
hr: verzija za tisak

source: Problem loading image of payment slip
hr: Problem kod učitavanja slike uplatnice

source: proportional
hr: proporcionalni

source: Recipient address
hr: Adresa primatelja

source: Recipient bank name
hr: Naziv banke primatelja

source: Recipient city
hr: Naziv mjesta poštanskog ureda primatelja

source: Recipient name
hr: Naziv primatelja

source: Recipient person type
hr: Tip osobe primatelja

source: Recipient postal code
hr: Poštanski broj primatelja

source: Recipient SWIFT/BIC code
hr: SWIFT/BIC kod primatelja

source: Recipient's IBAN
hr: IBAN primatelja

source: Recipient's reference number
hr: Poziv na broj primatelja

source: SEPA transfer currency code
hr: Oznaka valute za SEPA prijenos

source: SWIFT charge option
hr: SWIFT troškovna opcija

source: This feature might not work if you are using dedicated SMTP service provider causing e-mails about order completion not being delivered, even if you aren't actually attaching images. In case you are using it and you've noticed that customers are not receiving e-mail confirmation on order creation, disabling this feature should help - images will be then treated as regular attachment, but at least the e-mails will be delivered to the customers!
hr: Ova značajka Vam možda neće raditi ukoliko koristite kakvog zasebnog pružatelja SMTP usluge uzrokujući pritom da kupcima ne budu dostavljene e-mail poruke o završetku narudžbe, čak ukoliko se zapravo ni ne prilažu konkretno slike. U slučaju da korištite ovu značajku te primijetite da kupci ne primaju potvrde o kreiranoj narudžbi putem e-maila, njeno isključivanje bi trebalo pomoći - slike će se tada tretirati kao uobičajeni privici, no barem će e-mail poruke biti dostavljene kupcima!

source: Title
hr: Naslov

source: Type of the image with the generated payment slip
hr: Format slike s generiranom općom uplatnicom

source: universal
hr: univerzalni

source: Variables such as %order%, %date%, %year%, %month% and %day% can be used.
hr: Možete koristiti %order%, %date%, %year%, %month% i %day% varijable.

source: Which side will have to pay payment fee/costs. BEN for other side, OUR for us or SHA for cost sharing
hr: Koja strana plaća naknadu za SEPA prijenos. BEN za drugu stranu, OUR za Vas ili SHA za podjelu troškova

source: Width of the inline image in e-mail message
hr: Širina slike u tijelu e-mail poruke

source: Zero or more files of generated payment slip to be included as attachments of order completion e-mail message. Note that images will be embedded inside of e-mail message body if selected and if supported by user e-mail client
hr: Nula ili više datoteka s generiranom slikom opće uplatnice koje će biti priložene u e-mail poruci za kupca o uspješno-kreiranoj narudžbi. Napomena da odabirom slikovnih datoteka će one ujedno biti ugrađene unutar samog sadržaja e-mail poruke, ukoliko je takav način prikaza slika podržan od strane korisnikove klijentske aplikacije za rad s e-poštom

source: Zero or more files of generated payments slip to be available for download on the thank you page that is shown after order completion. If no options are selected, download button isn't shown. If multiple options are selected, then click on the download button displays dropdown for selection of file type with payment slip to download
hr: Nula ili više datoteka s generiranom slikom opće uplatnice koje će biti raspoložive za preuzimanje na web-stranici s detaljima o kreiranoj narudžbi. Ukoliko nijedna od opcija nije označena, tipka za preuzimanje neće biti prikazana. Ako je pak označeno više opcija, tada će se klikom na tipku za preuzimanje prikazati padajući izbornik za odabir željenog tipa datoteke s općom uplatnicom za preuzimanje
